load_test_result.txt
./vegeta -cpus 4 attack -duration=50s -rate=150 < target.txt | tee result.bin | ./vegeta report -every 5s

Without parallel lookups 

Requests      [total, rate, throughput]         7500, 150.02, 150.01
Duration      [total, attack, wait]             49.998s, 49.993s, 4.675ms
Latencies     [min, mean, 50, 90, 95, 99, max]  1.956ms, 16.095ms, 6.163ms, 41.072ms, 69.017ms, 143.468ms, 222.072ms
Bytes In      [total, mean]                     16242558, 2165.67
Bytes Out     [total, mean]                     6787500, 905.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:7500  
Error Set: